openocd-org/openocd/src/flash/nor/max32xxx_qspi.c
// SPDX-License-Identifier: GPL-2.0-or-later

/***************************************************************************
 *   Copyright (C) 2016 - 2019 by Andreas Bolsch                           *
 *   andreas.bolsch@mni.thm.de                                             *
 *                                                                         *
 *   Copyright (C) 2010 by Antonio Borneo                                  *
 *   borneo.antonio@gmail.com                                              *
 *                                                                         *
 *   Portions Copyright (C) 2025-2026 Analog Devices, Inc.                 *
 *   pete.johanson@analog.com                                              *
 ***************************************************************************/

#ifdef HAVE_CONFIG_H
#include "config.h"
#endif

#include "imp.h"
#include "max32xxx_options.h"
#include "max32xxx_qspi_common_defs.h"
#include <helper/binarybuffer.h>
#include <helper/bits.h>
#include <helper/time_support.h>
#include <target/algorithm.h>
#include <target/armv7m.h>
#include <target/image.h>
#include "spi.h"
#include "sfdp.h"

#define SPIXFC_FIFO_DEPTH 16
// 16-bit filler magic word indicating this isn't a header
#define SPIXFC_HEADER_NULL 0xF000

#define SPIXF_BASE 0x40026000
#define SPIXF_CFG (SPIXF_BASE | 0x00)
#define SPIXF_FETCH_CTRL (SPIXF_BASE | 0x04)
#define SPIXF_MODE_CTRL (SPIXF_BASE | 0x08)
#define SPIXF_MODE_DATA (SPIXF_BASE | 0x0C)
#define SPIXF_SCLK_FB_CTRL (SPIXF_BASE | 0x10)
#define SPIXF_IO_CTRL (SPIXF_BASE | 0x1C)
#define SPIXF_MEMSECCN (SPIXF_BASE | 0x20)
#define SPIXF_BUS_IDLE (SPIXF_BASE | 0x24)

#define SPIXF_MEMSECCN_ENC_ENABLE 0x1
#define SPIXF_MEMSECCN_AUTH_DISABLE 0x2

#define SPI_ICC_BASE 0x4002F000
#define SPI_ICC_CTRL (SPI_ICC_BASE | 0x100)
#define SPI_ICC_INV (SPI_ICC_BASE | 0x700)

#define SPI_ICC_CTRL_EN_POS 0
#define SPI_ICC_CTRL_EN (0x1UL << SPI_ICC_CTRL_EN_POS)
#define SPI_ICC_CTRL_RDY_POS 16
#define SPI_ICC_CTRL_RDY (0x1UL << SPI_ICC_CTRL_RDY_POS)

#define GCR_BASE 0x40000000
#define GCR_SCON (GCR_BASE | 0x00)
#define GCR_RST1 (GCR_BASE | 0x44)
#define GCR_RST1_XSPIM (0x1 << 4)
#define GCR_RST1_SPIXIP (0x1 << 5)

// Set the number of system clocks per low/high period of the SPI clock
#define SPI_CLOCK_PERIOD 2

// Flash timeout values in milliseconds.
#define MAX32XXX_QSPI_MASS_ERASE_TIMEOUT_MS 100000
#define MAX32XXX_QSPI_ERASE_TIMEOUT_MS 10000
#define MAX32XXX_QSPI_WE_TIMEOUT_MS 100
#define MAX32XXX_QSPI_FIFO_TIMEOUT_MS 100

// Set this to 1 to enable dual (1-2-2) reads if available from SFDP
#ifndef SPI_DUAL_MODE
#define SPI_DUAL_MODE 0
#endif

static const uint8_t write_code[] = {
#include "contrib/loaders/flash/max32xxx_qspi/max32xxx_qspi.inc"
};

struct max32xxx_qspi_flash_bank {
	bool probed;
	char devname[32];
	struct flash_device dev;
	unsigned int options;
};

FLASH_BANK_COMMAND_HANDLER(max32xxx_qspi_flash_bank_command)
{
	LOG_DEBUG("%s", __func__);

	if (CMD_ARGC < 7 || CMD_ARGC > 7) {
		LOG_ERROR("incorrect flash bank max32xxx_qspi configuration: "
				  "<flash_addr_base> <flash_addr_size> 0 0 <target> <opitons>");
		return ERROR_COMMAND_SYNTAX_ERROR;
	}

	struct max32xxx_qspi_flash_bank *info;
	info = malloc(sizeof(struct max32xxx_qspi_flash_bank));
	if (!info) {
		LOG_ERROR("not enough memory");
		return ERROR_FAIL;
	}

	bank->driver_priv = info;

	info->probed = false;
	COMMAND_PARSE_NUMBER(u32, CMD_ARGV[6], info->options);
	bank->driver_priv = info;

	return ERROR_OK;
}

static int max32xxx_qspi_pre_op(struct flash_bank *bank)
{
	struct target *target = bank->target;
	// Set the number of system clocks for the SPI clock low and high period
	int retval = target_write_u32(target, SPIXFC_CFG, (SPI_CLOCK_PERIOD << 8) | (SPI_CLOCK_PERIOD << 12));
	if (retval != ERROR_OK)
		return retval;

	// Enable the peripheral, FIFOs and SCK feedback
	retval = target_write_u32(target, SPIXFC_GEN_CTRL, (0x7 << 0) | (0x1 << 5) | (0x1 << 24));
	if (retval != ERROR_OK)
		return retval;

	return retval;
}

static int max32xxx_qspi_post_op(struct flash_bank *bank)
{
	struct target *target = bank->target;
	// Disable the SPI ICC
	int retval = target_write_u32(target, SPI_ICC_CTRL, 0);
	if (retval != ERROR_OK)
		return retval;

	// Disable SPIXFC
	retval = target_write_u32(target, SPIXFC_GEN_CTRL, 0);
	if (retval != ERROR_OK)
		return retval;

	// Reset SPI peripherals
	retval = target_write_u32(target, GCR_RST1, GCR_RST1_XSPIM | GCR_RST1_SPIXIP);
	if (retval != ERROR_OK)
		return retval;

	// Wait for reset to complete
	uint32_t temp32 = 1;
	while (temp32) {
		retval = target_read_u32(target, GCR_RST1, &temp32);
		if (retval != ERROR_OK)
			return retval;
	}

	// Invalidate cache
	retval = target_write_u32(target, SPI_ICC_INV, 1);
	if (retval != ERROR_OK)
		return retval;

	// Wait for the ready bit
	temp32 = 0;
	while (!temp32) {
		retval = target_read_u32(target, SPI_ICC_CTRL, &temp32);
		if (retval != ERROR_OK)
			return retval;
		temp32 &= SPI_ICC_CTRL_RDY;
	}

	// Set the number of system clocks for the SPI clock low and high period
	retval = target_write_u32(target, SPIXF_CFG, (SPI_CLOCK_PERIOD << 8) | (SPI_CLOCK_PERIOD << 12) | (0x1 << 2));
	if (retval != ERROR_OK)
		return retval;

	struct max32xxx_qspi_flash_bank *max32xxx_qspi_info = bank->driver_priv;
	// Enter 1-2-2 mode
	if (SPI_DUAL_MODE && max32xxx_qspi_info->dev.dread_cmd != 0x0) {
		LOG_DEBUG("Entering 1-2-2 read mode");

		// Set the read command
		retval = target_write_u32(target, SPIXF_FETCH_CTRL,
				(0x1 << 10) | (0x1 << 12) | max32xxx_qspi_info->dev.dread_cmd);
		if (retval != ERROR_OK)
			return retval;

		// Set mode control
		retval = target_write_u32(target, SPIXF_MODE_CTRL,
				max32xxx_qspi_info->dev.dread_mode + max32xxx_qspi_info->dev.dread_dclk);
		if (retval != ERROR_OK)
			return retval;
	} else {
		// Set the read command
		temp32 = max32xxx_qspi_info->dev.read_cmd;
		// Enable 4 byte addresses if using read command 0x13
		if (max32xxx_qspi_info->dev.read_cmd == 0x13)
			temp32 |= 0x1 << 16;
		retval = target_write_u32(target, SPIXF_FETCH_CTRL, temp32);
		if (retval != ERROR_OK)
			return retval;

