openocd-org/openocd/src/flash/nor/max32xxx_qspi.c
		// Set mode control
		retval = target_write_u32(target, SPIXF_MODE_CTRL, 0);
		if (retval != ERROR_OK)
			return retval;
	}

	// Setup the encryption options
	if (max32xxx_qspi_info->options & OPTIONS_ENC) {
		temp32 = SPIXF_MEMSECCN_ENC_ENABLE;

		if (!(max32xxx_qspi_info->options & OPTIONS_AUTH))
			temp32 |= SPIXF_MEMSECCN_AUTH_DISABLE;
		retval = target_write_u32(target, SPIXF_MEMSECCN, temp32);
		if (retval != ERROR_OK)
			return retval;
	} else {
		retval = target_write_u32(target, SPIXF_MEMSECCN, 0);
		if (retval != ERROR_OK)
			return retval;
	}

	// Enable feedback mode
	retval = target_write_u32(target, SPIXF_SCLK_FB_CTRL, 1);
	if (retval != ERROR_OK)
		return retval;

	// Bus idle timeout
	retval = target_write_u32(target, SPIXF_BUS_IDLE, 1);
	if (retval != ERROR_OK)
		return retval;

	// Enable cache
	retval = target_write_u32(target, SPI_ICC_CTRL, SPI_ICC_CTRL_EN);
	if (retval != ERROR_OK)
		return retval;

	// Clear the code cache
	retval = target_read_u32(target, GCR_SCON, &temp32);
	if (retval != ERROR_OK)
		return retval;
	temp32 |= (0x1 << 6);
	retval = target_write_u32(target, GCR_SCON, temp32);
	if (retval != ERROR_OK)
		return retval;

	return retval;
}

static int max32xxx_qspi_write_txfifo(struct target *target,
		const uint8_t *data, unsigned int len)
{
	int retval = ERROR_OK;
	unsigned int data_i = 0;

	while (len - data_i) {
		unsigned int write_len;

		// Calculate how many bytes we can write on this round
		if (len - data_i > SPIXFC_FIFO_DEPTH)
			write_len = SPIXFC_FIFO_DEPTH;
		else
			write_len = len - data_i;

		// Wait for there to be room in the TX FIFO
		const int64_t start_time = timeval_ms();
		unsigned int tx_fifo_avail;
		do {
			uint32_t temp32;
			retval = target_read_u32(target, SPIXFC_FIFO_CTRL, &temp32);
			if (retval != ERROR_OK)
				return retval;
			tx_fifo_avail = SPIXFC_FIFO_DEPTH -
							((temp32 & SPIXFC_FIFO_CTRL_TX_FIFO_CNT) >>
									SPIXFC_FIFO_CTRL_TX_FIFO_CNT_POS);

			if (timeval_ms() - start_time > MAX32XXX_QSPI_FIFO_TIMEOUT_MS)
				return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;

			keep_alive();
		} while (tx_fifo_avail < write_len);

		while (write_len) {
			uint16_t write_data = data[data_i++];

			if (data_i < len) {
				write_data |= (data[data_i++] << 8);
				write_len -= 2;
			} else {
				write_data |= SPIXFC_HEADER_NULL;
				write_len -= 1;
			}
			retval = target_write_u16(target, SPIXFC_FIFO_TX, write_data);
			if (retval != ERROR_OK)
				return retval;
		}
	}

	return retval;
}

static int max32xxx_qspi_read_rxfifo(struct target *target, uint8_t *data,
		unsigned int len)
{
	int retval = ERROR_OK;
	unsigned int data_i = 0;

	while (len - data_i) {
		unsigned int read_len;

		// Wait for there to be data in the RX FIFO
		const int64_t start_time = timeval_ms();
		unsigned int rx_fifo_avail;
		do {
			uint32_t temp32;
			retval = target_read_u32(target, SPIXFC_FIFO_CTRL, &temp32);
			if (retval != ERROR_OK)
				return retval;
			rx_fifo_avail = (temp32 & SPIXFC_FIFO_CTRL_RX_FIFO_CNT) >>
							SPIXFC_FIFO_CTRL_RX_FIFO_CNT_POS;

			if (timeval_ms() - start_time > MAX32XXX_QSPI_FIFO_TIMEOUT_MS)
				return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;

			keep_alive();
		} while (!rx_fifo_avail);

		// Calculate how many bytes we can write on this round
		if (len - data_i > rx_fifo_avail)
			read_len = rx_fifo_avail;
		else
			read_len = len - data_i;

		while (read_len) {
			retval = target_read_u8(target, SPIXFC_FIFO_RX, &data[data_i++]);
			if (retval != ERROR_OK)
				return retval;
			read_len--;
		}
	}

	return retval;
}

static int max32xxx_qspi_write_bytes(struct target *target, const uint8_t *data,
		unsigned int len, bool deass)
{
	int retval = ERROR_OK;
	unsigned int data_i = 0;

	// Wrap the length
	while (len - data_i) {
		unsigned int chunk_len;
		// Max transaction length is 32 units
		if (len - data_i > 32)
			chunk_len = 32;
		else
			chunk_len = len - data_i;

		// Setup the SPI header, 32 maps to 0 in the size field
		uint16_t header = SPIXFC_HEADER_TX | SPIXFC_HEADER_BYTE;
		if (chunk_len != 32)
			header |= chunk_len << SPIXFC_HEADER_SIZE_POS;

		// If we de-asserting and this is the final chunk
		if (deass && (len - data_i - chunk_len == 0))
			header |= SPIXFC_HEADER_SS_DEASS;

		// Write the header to the TX FIFO
		retval = max32xxx_qspi_write_txfifo(target, (uint8_t *)&header,
				sizeof(header));
		if (retval != ERROR_OK)
			return retval;

		// Write the data to the TX FIFO
		retval = max32xxx_qspi_write_txfifo(target, &data[data_i], chunk_len);
		if (retval != ERROR_OK)
			return retval;
		data_i += chunk_len;
	}

	return retval;
}

static int max32xxx_qspi_read_bytes(struct target *target, uint8_t *data,
		unsigned int len, bool deass)
{
	int retval = ERROR_OK;
	unsigned int data_i = 0;

	// Wrap the length
	while (len - data_i) {
		unsigned int chunk_len;
		// Max transaction length is 32 units
		if (len - data_i > 32)
			chunk_len = 32;
		else
			chunk_len = len - data_i;

		// Setup the SPI header, 32 maps to 0 in the size field
		uint16_t header = SPIXFC_HEADER_RX | SPIXFC_HEADER_BYTE;
		if (chunk_len != 32)
			header |= chunk_len << SPIXFC_HEADER_SIZE_POS;

		// If we de-asserting and this is the final chunk
		if (deass && (len - data_i - chunk_len == 0))
			header |= SPIXFC_HEADER_SS_DEASS;

		// Write the header to the TX FIFO
		retval = max32xxx_qspi_write_txfifo(target, (uint8_t *)&header,
				sizeof(header));
		if (retval != ERROR_OK)
			return retval;

		// Read the data to the TX FIFO, convert to number of bytes
		retval = max32xxx_qspi_read_rxfifo(target, (uint8_t *)&data[data_i],
				chunk_len);
		if (retval != ERROR_OK)
			return retval;
		data_i += chunk_len;
	}

	return retval;
}

static int max32xxx_qspi_read_words(struct target *target, uint32_t *data,
		unsigned int len, bool deass)
{
	uint32_t temp32;
	unsigned int data_i = 0;

	// Configure the page size
	int retval = target_read_u32(target, SPIXFC_CFG, &temp32);
	if (retval != ERROR_OK)
		return retval;
	temp32 = (temp32 & ~(SPIXFC_CONFIG_PAGE_SIZE)) |
			 SPIXFC_CONFIG_PAGE_SIZE_4_BYTES;
	retval = target_write_u32(target, SPIXFC_CFG, temp32);
	if (retval != ERROR_OK)
		return retval;

	while (len - data_i) {
		unsigned int chunk_len;
		// Max transaction length is 32 units
		if (len - data_i > 32)
			chunk_len = 32;
		else
			chunk_len = len - data_i;

		// Setup the SPI header
		uint16_t header = SPIXFC_HEADER_RX | SPIXFC_HEADER_PAGE;
		if (chunk_len != 32)
			header |= chunk_len << SPIXFC_HEADER_SIZE_POS;

		// If we de-asserting and this is the final chunk
		if (deass && (len - data_i - chunk_len == 0))
			header |= SPIXFC_HEADER_SS_DEASS;

		// Write the header to the TX FIFO
		retval = max32xxx_qspi_write_txfifo(target, (uint8_t *)&header,
				sizeof(header));
		if (retval != ERROR_OK)
			return retval;

		// Read the data to the TX FIFO, convert to number of bytes
		uint8_t *data8 = (uint8_t *)data;
		retval = max32xxx_qspi_read_rxfifo(target,
				(uint8_t *)&data8[data_i * 4], chunk_len * 4);
		if (retval != ERROR_OK)
			return retval;
		data_i += chunk_len;
	}

	return retval;
}

static int max32xxx_qspi_poll_wip(struct target *target, unsigned int timeout)
{
	const int64_t start_time = timeval_ms();
	uint8_t read_data;
	int retval;

	do {
		uint8_t cmd_data = SPIFLASH_READ_STATUS;
		retval = max32xxx_qspi_write_bytes(target, &cmd_data, 1, false);
		if (retval != ERROR_OK)
			return retval;

		read_data = SPIFLASH_BSY_BIT;
		retval = max32xxx_qspi_read_bytes(target, &read_data, 1, true);
		if (retval != ERROR_OK) {
			LOG_ERROR("Failed to read the status bytes");
			return retval;
		}

