openocd-org/openocd/src/flash/nor/max32xxx_qspi.c
		// Prevent GDB warnings
		keep_alive();

		if (timeval_ms() - start_time > timeout) {
			LOG_ERROR("Timed out waiting for flash");
			return ERROR_TIMEOUT_REACHED;
		}

	} while (read_data & SPIFLASH_BSY_BIT);

	return ERROR_OK;
}

static int max32xxx_qspi_poll_we(struct target *target)
{
	const int64_t start_time = timeval_ms();
	uint8_t read_data;
	int retval;

	do {
		uint8_t cmd_data = SPIFLASH_READ_STATUS;
		retval = max32xxx_qspi_write_bytes(target, &cmd_data, 1, false);
		if (retval != ERROR_OK) {
			LOG_ERROR("Failed to write the read status bytes");
			return retval;
		}

		read_data = 0;
		retval = max32xxx_qspi_read_bytes(target, &read_data, 1, true);
		if (retval != ERROR_OK) {
			LOG_ERROR("Failed to read the status bytes");
			return retval;
		}

		// Prevent GDB warnings
		keep_alive();

		if (timeval_ms() - start_time > MAX32XXX_QSPI_WE_TIMEOUT_MS) {
			LOG_ERROR("Timed out waiting for write enable");
			return ERROR_TIMEOUT_REACHED;
		}

	} while (!(read_data & SPIFLASH_WE_BIT));

	return ERROR_OK;
}

static int max32xxx_qspi_set_we(struct target *target)
{
	uint8_t cmd_data = SPIFLASH_WRITE_ENABLE;

	// TODO: Could also be instruction 0x50
	int retval = max32xxx_qspi_write_bytes(target, &cmd_data, 1, true);
	if (retval != ERROR_OK) {
		LOG_ERROR("Failed to write the write-enable bytes");
		return retval;
	}

	return max32xxx_qspi_poll_we(target);
}

static int max32xxx_qspi_erase(struct flash_bank *bank, unsigned int first,
		unsigned int last)
{
	struct target *target = bank->target;
	struct max32xxx_qspi_flash_bank *max32xxx_qspi_info = bank->driver_priv;

	LOG_DEBUG("%s: first = %d last = %d\n", __func__, first, last);

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	int retval = max32xxx_qspi_pre_op(bank);
	if (retval != ERROR_OK)
		return retval;

	while (first <= last) {
		// Set the write enable
		retval = max32xxx_qspi_set_we(target);
		if (retval != ERROR_OK) {
			LOG_ERROR("Failed to set the write-enable bit!");
			goto exit;
		}

		uint8_t cmd_data[5];
		// Send the erase command
		cmd_data[0] = max32xxx_qspi_info->dev.erase_cmd;
		// Address is MSB first
		uint32_t addr = (first++) * ((max32xxx_qspi_info)->dev.sectorsize);

		if (max32xxx_qspi_info->dev.erase_cmd == 0xdc) {
			cmd_data[4] = (addr & 0x000000FF) >> 0;
			cmd_data[3] = (addr & 0x0000FF00) >> 8;
			cmd_data[2] = (addr & 0x00FF0000) >> 16;
			cmd_data[1] = (addr & 0xFF000000) >> 24;
			retval = max32xxx_qspi_write_bytes(target, cmd_data, 5, true);
		} else {
			cmd_data[3] = (addr & 0x0000FF) >> 0;
			cmd_data[2] = (addr & 0x00FF00) >> 8;
			cmd_data[1] = (addr & 0xFF0000) >> 16;
			retval = max32xxx_qspi_write_bytes(target, cmd_data, 4, true);
		}

		if (retval != ERROR_OK)
			goto exit;

		// Poll WIP until erase is complete
		retval = max32xxx_qspi_poll_wip(target, MAX32XXX_QSPI_ERASE_TIMEOUT_MS);
		if (retval != ERROR_OK) {
			LOG_ERROR("Flash bank didn't respond to status request after erase");
			goto exit;
		}
	}

exit:
	{
		int post_retval = max32xxx_qspi_post_op(bank);
		if (retval == ERROR_OK)
			retval = post_retval;
	}

	return retval;
}

static int max32xxx_qspi_write_block(struct flash_bank *bank,
		const uint8_t *buffer, uint32_t offset, uint32_t len)
{
	struct target *target = bank->target;
	struct working_area *write_algorithm;

	LOG_DEBUG("max32xxx_write_block bank=%p buffer=%p offset=%08" PRIx32
			  " len=%08" PRIx32 "",
			bank, buffer, offset, len);

	// flash write code
	int retval = target_alloc_working_area(target, sizeof(write_code),
			&write_algorithm);
	if (retval != ERROR_OK)
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;

	// memory buffer
	uint32_t buffer_size = target_get_working_area_avail(target);
	struct working_area *source;
	const uint32_t algo_overhead = SPIX_ALGO_TAIL_SIZE;
	const uint32_t minimal_buffer_size = algo_overhead + 256;

	if (buffer_size > 16384)
		buffer_size = 16384;

	if (buffer_size <= minimal_buffer_size) {
		target_free_working_area(target, write_algorithm);
		LOG_WARNING("Insufficient working area for block write algorithm");
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	}

	retval = target_alloc_working_area(target, buffer_size, &source);
	if (retval != ERROR_OK) {
		target_free_working_area(target, write_algorithm);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	}

	retval = target_write_buffer(target, write_algorithm->address,
			sizeof(write_code), write_code);
	if (retval != ERROR_OK) {
		target_free_working_area(target, write_algorithm);
		target_free_working_area(target, source);
		return retval;
	}

	struct armv7m_algorithm armv7m_info;
	armv7m_info.common_magic = ARMV7M_COMMON_MAGIC;
	armv7m_info.core_mode = ARM_MODE_THREAD;

	struct reg_param reg_params[5];
	init_reg_param(&reg_params[0], "r0", 32, PARAM_OUT);
	init_reg_param(&reg_params[1], "r1", 32, PARAM_OUT);
	init_reg_param(&reg_params[2], "r2", 32, PARAM_OUT);
	init_reg_param(&reg_params[3], "r3", 32, PARAM_OUT);
	init_reg_param(&reg_params[4], "sp", 32, PARAM_OUT);

	buf_set_u32(reg_params[0].value, 0, 32, source->address);
	buf_set_u32(reg_params[1].value, 0, 32, source->address + source->size);
	buf_set_u32(reg_params[2].value, 0, 32, len);
	buf_set_u32(reg_params[3].value, 0, 32, offset);
	buf_set_u32(reg_params[4].value, 0, 32, source->address + source->size);

	/* mem_params for options and command live in the shared tail layout. */
	struct mem_param mem_param[2];
	const uint32_t tail_base = source->address + source->size - SPIX_ALGO_TAIL_SIZE;
	init_mem_param(&mem_param[0],
			tail_base + SPIX_ALGO_OPTIONS_OFFSET, 4,
			PARAM_OUT);
	init_mem_param(&mem_param[1],
			tail_base + SPIX_ALGO_SPI_WRITE_CMD_OFFSET, 4,
			PARAM_OUT);
	struct max32xxx_qspi_flash_bank *max32xxx_qspi_info = bank->driver_priv;
	buf_set_u32(mem_param[0].value, 0, 32, max32xxx_qspi_info->options);
	buf_set_u32(mem_param[1].value, 0, 32, max32xxx_qspi_info->dev.pprog_cmd);

	LOG_DEBUG("max32xxx_write_block source->address=" TARGET_ADDR_FMT
			  " source->size=0x%08" PRIx32,
			source->address, source->size);

