openocd-org/openocd/src/flash/nor/max32xxx_qspi.c
	const uint32_t source_data_size = source->size - algo_overhead;
	const uint32_t algo_end = write_algorithm->address + sizeof(write_code) - 2;

	retval = target_run_flash_async_algorithm(target,
			buffer, len, 1,
			ARRAY_SIZE(mem_param), mem_param,
			ARRAY_SIZE(reg_params), reg_params,
			source->address, source_data_size,
			write_algorithm->address, algo_end,
			&armv7m_info);

	if (retval == ERROR_FLASH_OPERATION_FAILED)
		LOG_ERROR("error executing max32xxx qspi write algorithm at " TARGET_ADDR_FMT,
				write_algorithm->address);

	target_free_working_area(target, write_algorithm);
	target_free_working_area(target, source);
	destroy_reg_param(&reg_params[0]);
	destroy_reg_param(&reg_params[1]);
	destroy_reg_param(&reg_params[2]);
	destroy_reg_param(&reg_params[3]);
	destroy_reg_param(&reg_params[4]);

	return retval;
}

static int max32xxx_qspi_write(struct flash_bank *bank, const uint8_t *buffer,
		uint32_t offset, uint32_t count)
{
	struct target *target = bank->target;

	LOG_DEBUG("%s: offset=0x%08" PRIx32 " count=0x%08" PRIx32, __func__, offset,
			count);

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	struct max32xxx_qspi_flash_bank *max32xxx_qspi_info = bank->driver_priv;

	if (offset + count > bank->size) {
		LOG_ERROR("Write beyond end of flash.");
		return ERROR_FLASH_DST_OUT_OF_BANK;
	}

	int retval = ERROR_OK;
	// Determine if we want to use the on-chip algorithm
	if (max32xxx_qspi_info->options & OPTIONS_ENC || count > 16) {
		if (max32xxx_qspi_info->options & OPTIONS_AUTH) {
			/* Need to erase extra length if we're writing authentication data
			 */
			uint32_t max_sector_plain =
					(offset + count) / max32xxx_qspi_info->dev.sectorsize;
			uint32_t max_sector_auth = (offset + count * 10 / 8) /
									   max32xxx_qspi_info->dev.sectorsize;
			if (max_sector_auth > max_sector_plain) {
				LOG_WARNING("Erasing extra flash for authentication data");
				retval = max32xxx_qspi_erase(bank, max_sector_plain,
						max_sector_auth);
				if (retval != ERROR_OK)
					return retval;
			}
		}

		retval = max32xxx_qspi_pre_op(bank);
		if (retval != ERROR_OK)
			return retval;

		retval = max32xxx_qspi_write_block(bank, buffer, offset, count);

		if (retval != ERROR_OK) {
			if (retval == ERROR_TARGET_RESOURCE_NOT_AVAILABLE) {
				if (max32xxx_qspi_info->options & OPTIONS_ENC) {
					LOG_ERROR("Must use algorithm in working area for "
							  "encryption");
					goto exit;
				}
				LOG_DEBUG("working area algorithm not available");
			} else {
				LOG_ERROR("Error with flash algorithm");
				goto exit;
			}
		} else {
			goto exit;
		}
	} else {
		retval = max32xxx_qspi_pre_op(bank);
		if (retval != ERROR_OK)
			return retval;
	}

	// Send the page program command
	uint8_t cmd_data[5];
	cmd_data[0] = max32xxx_qspi_info->dev.pprog_cmd;

	unsigned int buffer_i = 0;

	while (count - buffer_i) {
		// Set the write enable
		retval = max32xxx_qspi_set_we(target);
		if (retval != ERROR_OK)
			goto exit;

		unsigned int write_len = SPI_WRITE_BOUNDARY - (offset % SPI_WRITE_BOUNDARY);

		if (write_len > count - buffer_i)
			write_len = count - buffer_i;

		if (max32xxx_qspi_info->dev.pprog_cmd == 0x12) {
			cmd_data[4] = (offset & 0x000000FF) >> 0;
			cmd_data[3] = (offset & 0x0000FF00) >> 8;
			cmd_data[2] = (offset & 0x00FF0000) >> 16;
			cmd_data[1] = (offset & 0xFF000000) >> 24;
			// Write the command
			retval = max32xxx_qspi_write_bytes(target, cmd_data, 5, false);
		} else {
			// Address is MSB first
			cmd_data[3] = (offset & 0x0000FF) >> 0;
			cmd_data[2] = (offset & 0x00FF00) >> 8;
			cmd_data[1] = (offset & 0xFF0000) >> 16;
			// Write the command
			retval = max32xxx_qspi_write_bytes(target, cmd_data, 4, false);
		}

		if (retval != ERROR_OK)
			goto exit;

		// Write the data
		retval = max32xxx_qspi_write_bytes(target,
				&buffer[buffer_i], write_len, true);
		if (retval != ERROR_OK)
			goto exit;

		// Increment the pointers
		buffer_i += write_len;
		offset += write_len;
	}

exit:
	{
		int post_retval = max32xxx_qspi_post_op(bank);
		if (retval == ERROR_OK)
			retval = post_retval;
	}

	return retval;
}

static int read_sfdp_block(struct flash_bank *bank, uint32_t addr,
		uint32_t words, uint32_t *buffer)
{
	struct target *target = bank->target;
	uint8_t cmd_data[5];

	// Write the command
	cmd_data[0] = SPIFLASH_READ_SFDP;

	// Address is MSB first
	cmd_data[3] = (addr & 0x0000FF) >> 0;
	cmd_data[2] = (addr & 0x00FF00) >> 8;
	cmd_data[1] = (addr & 0xFF0000) >> 16;

	// 1 dummy bytes
	cmd_data[4] = 0;

	int retval = max32xxx_qspi_write_bytes(target, cmd_data, sizeof(cmd_data), false);
	if (retval != ERROR_OK)
		return retval;

	// Read the response, convert words to number of bytes
	retval = max32xxx_qspi_read_words(target, buffer, words, true);

	return retval;
}

static int max32xxx_qspi_probe(struct flash_bank *bank)
{
	struct max32xxx_qspi_flash_bank *max32xxx_qspi_info = bank->driver_priv;
	bool pre_op_done = false;

	LOG_DEBUG("%s", __func__);

	if (max32xxx_qspi_info->probed) {
		bank->size = 0;
		bank->num_sectors = 0;
		free(bank->sectors);
		bank->sectors = NULL;
		memset(&max32xxx_qspi_info->dev, 0, sizeof(max32xxx_qspi_info->dev));
		max32xxx_qspi_info->probed = false;
	}

	int retval = max32xxx_qspi_pre_op(bank);
	if (retval != ERROR_OK)
		return retval;
	pre_op_done = true;

	struct target *target = bank->target;
	uint32_t temp32;
	retval = target_read_u32(target, SPIXFC_CFG, &temp32);
	if (retval != ERROR_OK)
		goto exit;
	LOG_DEBUG("SPIXFC_CFG       = 0x%08X", temp32);

	retval = target_read_u32(target, SPIXFC_SS_POL, &temp32);
	if (retval != ERROR_OK)
		goto exit;
	LOG_DEBUG("SPIXFC_SS_POL    = 0x%08X", temp32);

	retval = target_read_u32(target, SPIXFC_GEN_CTRL, &temp32);
	if (retval != ERROR_OK)
		goto exit;
	LOG_DEBUG("SPIXFC_GEN_CTRL  = 0x%08X", temp32);

	retval = target_read_u32(target, SPIXFC_FIFO_CTRL, &temp32);
	if (retval != ERROR_OK)
		goto exit;
	LOG_DEBUG("SPIXFC_FIFO_CTRL = 0x%08X", temp32);

