openocd-org/openocd/src/flash/nor/max32xxx_qspi.c
	// Read the SFDP settings from the flash device
	struct flash_device temp_flash_device;
	retval = spi_sfdp(bank, &temp_flash_device, &read_sfdp_block);
	if (retval != ERROR_OK)
		goto exit;
	LOG_INFO("max32xxx flash \'%s\' size = %" PRIu32 " kbytes",
			temp_flash_device.name, temp_flash_device.size_in_bytes / 1024);

	max32xxx_qspi_info->dev = temp_flash_device;

	// Read the device ID
	uint8_t cmd = SPIFLASH_READ_ID;
	retval = max32xxx_qspi_write_bytes(target, &cmd, 1, false);
	if (retval != ERROR_OK)
		goto exit;

	retval = max32xxx_qspi_read_bytes(target,
			(uint8_t *)&max32xxx_qspi_info->dev.device_id, 3, true);
	if (retval != ERROR_OK)
		goto exit;

	// Set correct size value
	bank->size = max32xxx_qspi_info->dev.size_in_bytes;
	bank->write_start_alignment =
			(max32xxx_qspi_info->options & OPTIONS_AUTH) ? 0x80 : 16;
	bank->write_end_alignment = bank->write_start_alignment;

	// TODO: Get more than 1 erase command

	// Create and fill sectors array
	bank->num_sectors = max32xxx_qspi_info->dev.size_in_bytes /
						max32xxx_qspi_info->dev.sectorsize;
	struct flash_sector *sectors = malloc(sizeof(struct flash_sector) * bank->num_sectors);
	if (!sectors) {
		LOG_ERROR("not enough memory");
		retval = ERROR_FAIL;
		goto exit;
	}

	for (unsigned int sector = 0; sector < bank->num_sectors; sector++) {
		sectors[sector].offset = sector * max32xxx_qspi_info->dev.sectorsize;
		sectors[sector].size = max32xxx_qspi_info->dev.sectorsize;
		sectors[sector].is_erased = -1;
		sectors[sector].is_protected = 0;
	}

	bank->sectors = sectors;

	max32xxx_qspi_info->probed = true;

	// Setup memory mapped mode
	retval = max32xxx_qspi_post_op(bank);
	if (retval != ERROR_OK)
		goto exit;
	pre_op_done = false;

	retval = target_read_u32(target, SPIXF_CFG, &temp32);
	if (retval != ERROR_OK)
		goto exit;
	LOG_DEBUG("SPIXF_CFG			= 0x%08X", temp32);
	retval = target_read_u32(target, SPIXF_FETCH_CTRL, &temp32);
	if (retval != ERROR_OK)
		goto exit;
	LOG_DEBUG("SPIXF_FETCH_CTRL		= 0x%08X", temp32);
	retval = target_read_u32(target, SPIXF_MODE_CTRL, &temp32);
	if (retval != ERROR_OK)
		goto exit;
	LOG_DEBUG("SPIXF_MODE_CTRL		= 0x%08X", temp32);
	retval = target_read_u32(target, SPIXF_MODE_DATA, &temp32);
	if (retval != ERROR_OK)
		goto exit;
	LOG_DEBUG("SPIXF_MODE_DATA		= 0x%08X", temp32);
	retval = target_read_u32(target, SPIXF_SCLK_FB_CTRL, &temp32);
	if (retval != ERROR_OK)
		goto exit;
	LOG_DEBUG("SPIXF_SCLK_FB_CTRL	= 0x%08X", temp32);
	retval = target_read_u32(target, SPIXF_IO_CTRL, &temp32);
	if (retval != ERROR_OK)
		goto exit;
	LOG_DEBUG("SPIXF_IO_CTRL		= 0x%08X", temp32);
	retval = target_read_u32(target, SPIXF_MEMSECCN, &temp32);
	if (retval != ERROR_OK)
		goto exit;
	LOG_DEBUG("SPIXF_MEMSECCN		= 0x%08X", temp32);
	retval = target_read_u32(target, SPIXF_BUS_IDLE, &temp32);
	if (retval != ERROR_OK)
		goto exit;
	LOG_DEBUG("SPIXF_BUS_IDLE		= 0x%08X", temp32);

exit:
	if (pre_op_done) {
		int post_retval = max32xxx_qspi_post_op(bank);
		if (retval == ERROR_OK)
			retval = post_retval;
	}

	return retval;
}

static int max32xxx_qspi_auto_probe(struct flash_bank *bank)
{
	struct max32xxx_qspi_flash_bank *max32xxx_qspi_info = bank->driver_priv;

	if (max32xxx_qspi_info->probed)
		return ERROR_OK;
	return max32xxx_qspi_probe(bank);
}

COMMAND_HANDLER(max32xxx_qspi_handle_mem_mapping_setup_command)
{
	int retval;

	struct flash_bank *bank;
	retval = CALL_COMMAND_HANDLER(flash_command_get_bank, 0, &bank);
	if (retval != ERROR_OK)
		return retval;

	return max32xxx_qspi_post_op(bank);
}

COMMAND_HANDLER(max32xxx_qspi_handle_mass_erase_command)
{
	struct flash_bank *bank;

	LOG_DEBUG("%s", __func__);

	if (CMD_ARGC != 1)
		return ERROR_COMMAND_SYNTAX_ERROR;

	int retval = CALL_COMMAND_HANDLER(flash_command_get_bank, 0, &bank);
	if (retval != ERROR_OK)
		return retval;

	struct target *target = bank->target;
	if (target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	struct max32xxx_qspi_flash_bank *max32xxx_qspi_info = bank->driver_priv;
	if (!(max32xxx_qspi_info->probed)) {
		LOG_ERROR("Flash bank not probed");
		return ERROR_FLASH_BANK_NOT_PROBED;
	}

	if (max32xxx_qspi_info->dev.chip_erase_cmd == 0x00) {
		LOG_ERROR("Mass erase not available for this device");
		return ERROR_FLASH_OPER_UNSUPPORTED;
	}

	retval = max32xxx_qspi_pre_op(bank);
	if (retval != ERROR_OK)
		return retval;

	// Set the write enable
	retval = max32xxx_qspi_set_we(target);
	if (retval != ERROR_OK)
		goto exit;

	// Send the mass erase command
	uint8_t cmd_data[1];
	cmd_data[0] = max32xxx_qspi_info->dev.chip_erase_cmd;

	retval = max32xxx_qspi_write_bytes(target, cmd_data, 1, true);
	if (retval != ERROR_OK)
		goto exit;

	// Poll WIP until erase is complete
	retval = max32xxx_qspi_poll_wip(target, MAX32XXX_QSPI_MASS_ERASE_TIMEOUT_MS);

exit:
	{
		int post_retval = max32xxx_qspi_post_op(bank);
		if (retval == ERROR_OK)
			retval = post_retval;
	}

	return retval;
}

static int get_max32xxx_qspi_info(struct flash_bank *bank,
		struct command_invocation *cmd)
{
	struct max32xxx_qspi_flash_bank *max32xxx_qspi_info = bank->driver_priv;

	if (!(max32xxx_qspi_info->probed)) {
		command_print_sameline(cmd, "\nQSPI flash bank not probed yet\n");
		return ERROR_FLASH_BANK_NOT_PROBED;
	}

	command_print_sameline(cmd, "\nQSPI flash:\n");

	command_print_sameline(cmd, "  name          : \'%s\'\n",
			max32xxx_qspi_info->dev.name);
	command_print_sameline(cmd, "  ID            : 0x%06" PRIx32 "\n",
			max32xxx_qspi_info->dev.device_id);
	command_print_sameline(cmd, "  size          : 0x%08" PRIx32 " B\n",
			max32xxx_qspi_info->dev.size_in_bytes);
	command_print_sameline(cmd, "  page size     : 0x%08" PRIx32 " B\n",
			max32xxx_qspi_info->dev.pagesize);
	command_print_sameline(cmd, "  sector size   : 0x%08" PRIx32 " B\n",
			max32xxx_qspi_info->dev.sectorsize);
	command_print_sameline(cmd, "  read cmd      : 0x%02" PRIx32 "\n",
			max32xxx_qspi_info->dev.read_cmd);
	command_print_sameline(cmd, "  dread cmd     : 0x%02" PRIx32 "\n",
			max32xxx_qspi_info->dev.dread_cmd);
	command_print_sameline(cmd, "  dread mode    : 0x%02" PRIx32 "\n",
			max32xxx_qspi_info->dev.dread_mode);
	command_print_sameline(cmd, "  dread dclk    : 0x%02" PRIx32 "\n",
			max32xxx_qspi_info->dev.dread_dclk);
	command_print_sameline(cmd, "  qread cmd     : 0x%02" PRIx32 "\n",
			max32xxx_qspi_info->dev.qread_cmd);
	command_print_sameline(cmd, "  pprog cmd     : 0x%02" PRIx32 "\n",
			max32xxx_qspi_info->dev.pprog_cmd);
	command_print_sameline(cmd, "  erase cmd     : 0x%02" PRIx32 "\n",
			max32xxx_qspi_info->dev.erase_cmd);
	command_print_sameline(cmd, "  chip_erase cmd: 0x%02" PRIx32 "\n",
			max32xxx_qspi_info->dev.chip_erase_cmd);

	return ERROR_OK;
}

static const struct command_registration max32xxx_qspi_exec_command_handlers[] = {
	{
		.name = "mem_mapping_setup",
		.handler = max32xxx_qspi_handle_mem_mapping_setup_command,
		.mode = COMMAND_EXEC,
		.usage = "",
		.help = "Setup memory-mapped QSPI access.",
	},
	{
		.name = "mass_erase",
		.handler = max32xxx_qspi_handle_mass_erase_command,
		.mode = COMMAND_EXEC,
		.usage = "bank_id",
		.help = "Mass erase entire flash device.",
	},
	COMMAND_REGISTRATION_DONE
};

static const struct command_registration max32xxx_qspi_command_handlers[] = {
	{
		.name = "max32xxx_qspi",
		.mode = COMMAND_ANY,
		.help = "max32xxx_qspi flash command group",
		.usage = "",
		.chain = max32xxx_qspi_exec_command_handlers,
	},
	COMMAND_REGISTRATION_DONE
};

const struct flash_driver max32xxx_qspi_flash = {
	.name = "max32xxx_qspi",
	.commands = max32xxx_qspi_command_handlers,
	.flash_bank_command = max32xxx_qspi_flash_bank_command,
	.erase = max32xxx_qspi_erase,
	.protect = NULL,
	.write = max32xxx_qspi_write,
	.read = default_flash_read,
	.verify = default_flash_verify,
	.probe = max32xxx_qspi_probe,
	.auto_probe = max32xxx_qspi_auto_probe,
	.erase_check = default_flash_blank_check,
	.protect_check = NULL,
	.info = get_max32xxx_qspi_info,
	.free_driver_priv = default_flash_free_driver_priv,
};
